{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 13, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of379.bin", "group1-shard2of379.bin", "group1-shard3of379.bin", "group1-shard4of379.bin", "group1-shard5of379.bin", "group1-shard6of379.bin", "group1-shard7of379.bin", "group1-shard8of379.bin", "group1-shard9of379.bin", "group1-shard10of379.bin", "group1-shard11of379.bin", "group1-shard12of379.bin", "group1-shard13of379.bin", "group1-shard14of379.bin", "group1-shard15of379.bin", "group1-shard16of379.bin", "group1-shard17of379.bin", "group1-shard18of379.bin", "group1-shard19of379.bin", "group1-shard20of379.bin", "group1-shard21of379.bin", "group1-shard22of379.bin", "group1-shard23of379.bin", "group1-shard24of379.bin", "group1-shard25of379.bin", "group1-shard26of379.bin", "group1-shard27of379.bin", "group1-shard28of379.bin", "group1-shard29of379.bin", "group1-shard30of379.bin", "group1-shard31of379.bin", "group1-shard32of379.bin", "group1-shard33of379.bin", "group1-shard34of379.bin", "group1-shard35of379.bin", "group1-shard36of379.bin", "group1-shard37of379.bin", "group1-shard38of379.bin", "group1-shard39of379.bin", "group1-shard40of379.bin", "group1-shard41of379.bin", "group1-shard42of379.bin", "group1-shard43of379.bin", "group1-shard44of379.bin", "group1-shard45of379.bin", "group1-shard46of379.bin", "group1-shard47of379.bin", "group1-shard48of379.bin", "group1-shard49of379.bin", "group1-shard50of379.bin", "group1-shard51of379.bin", "group1-shard52of379.bin", "group1-shard53of379.bin", "group1-shard54of379.bin", "group1-shard55of379.bin", "group1-shard56of379.bin", "group1-shard57of379.bin", "group1-shard58of379.bin", "group1-shard59of379.bin", "group1-shard60of379.bin", "group1-shard61of379.bin", "group1-shard62of379.bin", "group1-shard63of379.bin", "group1-shard64of379.bin", "group1-shard65of379.bin", "group1-shard66of379.bin", "group1-shard67of379.bin", "group1-shard68of379.bin", "group1-shard69of379.bin", "group1-shard70of379.bin", "group1-shard71of379.bin", "group1-shard72of379.bin", "group1-shard73of379.bin", "group1-shard74of379.bin", "group1-shard75of379.bin", "group1-shard76of379.bin", "group1-shard77of379.bin", "group1-shard78of379.bin", "group1-shard79of379.bin", "group1-shard80of379.bin", "group1-shard81of379.bin", "group1-shard82of379.bin", "group1-shard83of379.bin", "group1-shard84of379.bin", "group1-shard85of379.bin", "group1-shard86of379.bin", "group1-shard87of379.bin", "group1-shard88of379.bin", "group1-shard89of379.bin", "group1-shard90of379.bin", "group1-shard91of379.bin", "group1-shard92of379.bin", "group1-shard93of379.bin", "group1-shard94of379.bin", "group1-shard95of379.bin", "group1-shard96of379.bin", "group1-shard97of379.bin", "group1-shard98of379.bin", "group1-shard99of379.bin", "group1-shard100of379.bin", "group1-shard101of379.bin", "group1-shard102of379.bin", "group1-shard103of379.bin", "group1-shard104of379.bin", "group1-shard105of379.bin", "group1-shard106of379.bin", "group1-shard107of379.bin", "group1-shard108of379.bin", "group1-shard109of379.bin", "group1-shard110of379.bin", "group1-shard111of379.bin", "group1-shard112of379.bin", "group1-shard113of379.bin", "group1-shard114of379.bin", "group1-shard115of379.bin", "group1-shard116of379.bin", "group1-shard117of379.bin", "group1-shard118of379.bin", "group1-shard119of379.bin", "group1-shard120of379.bin", "group1-shard121of379.bin", "group1-shard122of379.bin", "group1-shard123of379.bin", "group1-shard124of379.bin", "group1-shard125of379.bin", "group1-shard126of379.bin", "group1-shard127of379.bin", "group1-shard128of379.bin", "group1-shard129of379.bin", "group1-shard130of379.bin", "group1-shard131of379.bin", "group1-shard132of379.bin", "group1-shard133of379.bin", "group1-shard134of379.bin", "group1-shard135of379.bin", "group1-shard136of379.bin", "group1-shard137of379.bin", "group1-shard138of379.bin", "group1-shard139of379.bin", "group1-shard140of379.bin", "group1-shard141of379.bin", "group1-shard142of379.bin", "group1-shard143of379.bin", "group1-shard144of379.bin", "group1-shard145of379.bin", "group1-shard146of379.bin", "group1-shard147of379.bin", "group1-shard148of379.bin", "group1-shard149of379.bin", "group1-shard150of379.bin", "group1-shard151of379.bin", "group1-shard152of379.bin", "group1-shard153of379.bin", "group1-shard154of379.bin", "group1-shard155of379.bin", "group1-shard156of379.bin", "group1-shard157of379.bin", "group1-shard158of379.bin", "group1-shard159of379.bin", "group1-shard160of379.bin", "group1-shard161of379.bin", "group1-shard162of379.bin", "group1-shard163of379.bin", "group1-shard164of379.bin", "group1-shard165of379.bin", "group1-shard166of379.bin", "group1-shard167of379.bin", "group1-shard168of379.bin", "group1-shard169of379.bin", "group1-shard170of379.bin", "group1-shard171of379.bin", "group1-shard172of379.bin", "group1-shard173of379.bin", "group1-shard174of379.bin", "group1-shard175of379.bin", "group1-shard176of379.bin", "group1-shard177of379.bin", "group1-shard178of379.bin", "group1-shard179of379.bin", "group1-shard180of379.bin", "group1-shard181of379.bin", "group1-shard182of379.bin", "group1-shard183of379.bin", "group1-shard184of379.bin", "group1-shard185of379.bin", "group1-shard186of379.bin", "group1-shard187of379.bin", "group1-shard188of379.bin", "group1-shard189of379.bin", "group1-shard190of379.bin", "group1-shard191of379.bin", "group1-shard192of379.bin", "group1-shard193of379.bin", "group1-shard194of379.bin", "group1-shard195of379.bin", "group1-shard196of379.bin", "group1-shard197of379.bin", "group1-shard198of379.bin", "group1-shard199of379.bin", "group1-shard200of379.bin", "group1-shard201of379.bin", "group1-shard202of379.bin", "group1-shard203of379.bin", "group1-shard204of379.bin", "group1-shard205of379.bin", "group1-shard206of379.bin", "group1-shard207of379.bin", "group1-shard208of379.bin", "group1-shard209of379.bin", "group1-shard210of379.bin", "group1-shard211of379.bin", "group1-shard212of379.bin", "group1-shard213of379.bin", "group1-shard214of379.bin", "group1-shard215of379.bin", "group1-shard216of379.bin", "group1-shard217of379.bin", "group1-shard218of379.bin", "group1-shard219of379.bin", "group1-shard220of379.bin", "group1-shard221of379.bin", "group1-shard222of379.bin", "group1-shard223of379.bin", "group1-shard224of379.bin", "group1-shard225of379.bin", "group1-shard226of379.bin", "group1-shard227of379.bin", "group1-shard228of379.bin", "group1-shard229of379.bin", "group1-shard230of379.bin", "group1-shard231of379.bin", "group1-shard232of379.bin", "group1-shard233of379.bin", "group1-shard234of379.bin", "group1-shard235of379.bin", "group1-shard236of379.bin", "group1-shard237of379.bin", "group1-shard238of379.bin", "group1-shard239of379.bin", "group1-shard240of379.bin", "group1-shard241of379.bin", "group1-shard242of379.bin", "group1-shard243of379.bin", "group1-shard244of379.bin", "group1-shard245of379.bin", "group1-shard246of379.bin", "group1-shard247of379.bin", "group1-shard248of379.bin", "group1-shard249of379.bin", "group1-shard250of379.bin", "group1-shard251of379.bin", "group1-shard252of379.bin", "group1-shard253of379.bin", "group1-shard254of379.bin", "group1-shard255of379.bin", "group1-shard256of379.bin", "group1-shard257of379.bin", "group1-shard258of379.bin", "group1-shard259of379.bin", "group1-shard260of379.bin", "group1-shard261of379.bin", "group1-shard262of379.bin", "group1-shard263of379.bin", "group1-shard264of379.bin", "group1-shard265of379.bin", "group1-shard266of379.bin", "group1-shard267of379.bin", "group1-shard268of379.bin", "group1-shard269of379.bin", "group1-shard270of379.bin", "group1-shard271of379.bin", "group1-shard272of379.bin", "group1-shard273of379.bin", "group1-shard274of379.bin", "group1-shard275of379.bin", "group1-shard276of379.bin", "group1-shard277of379.bin", "group1-shard278of379.bin", "group1-shard279of379.bin", "group1-shard280of379.bin", "group1-shard281of379.bin", "group1-shard282of379.bin", "group1-shard283of379.bin", "group1-shard284of379.bin", "group1-shard285of379.bin", "group1-shard286of379.bin", "group1-shard287of379.bin", "group1-shard288of379.bin", "group1-shard289of379.bin", "group1-shard290of379.bin", "group1-shard291of379.bin", "group1-shard292of379.bin", "group1-shard293of379.bin", "group1-shard294of379.bin", "group1-shard295of379.bin", "group1-shard296of379.bin", "group1-shard297of379.bin", "group1-shard298of379.bin", "group1-shard299of379.bin", "group1-shard300of379.bin", "group1-shard301of379.bin", "group1-shard302of379.bin", "group1-shard303of379.bin", "group1-shard304of379.bin", "group1-shard305of379.bin", "group1-shard306of379.bin", "group1-shard307of379.bin", "group1-shard308of379.bin", "group1-shard309of379.bin", "group1-shard310of379.bin", "group1-shard311of379.bin", "group1-shard312of379.bin", "group1-shard313of379.bin", "group1-shard314of379.bin", "group1-shard315of379.bin", "group1-shard316of379.bin", "group1-shard317of379.bin", "group1-shard318of379.bin", "group1-shard319of379.bin", "group1-shard320of379.bin", "group1-shard321of379.bin", "group1-shard322of379.bin", "group1-shard323of379.bin", "group1-shard324of379.bin", "group1-shard325of379.bin", "group1-shard326of379.bin", "group1-shard327of379.bin", "group1-shard328of379.bin", "group1-shard329of379.bin", "group1-shard330of379.bin", "group1-shard331of379.bin", "group1-shard332of379.bin", "group1-shard333of379.bin", "group1-shard334of379.bin", "group1-shard335of379.bin", "group1-shard336of379.bin", "group1-shard337of379.bin", "group1-shard338of379.bin", "group1-shard339of379.bin", "group1-shard340of379.bin", "group1-shard341of379.bin", "group1-shard342of379.bin", "group1-shard343of379.bin", "group1-shard344of379.bin", "group1-shard345of379.bin", "group1-shard346of379.bin", "group1-shard347of379.bin", "group1-shard348of379.bin", "group1-shard349of379.bin", "group1-shard350of379.bin", "group1-shard351of379.bin", "group1-shard352of379.bin", "group1-shard353of379.bin", "group1-shard354of379.bin", "group1-shard355of379.bin", "group1-shard356of379.bin", "group1-shard357of379.bin", "group1-shard358of379.bin", "group1-shard359of379.bin", "group1-shard360of379.bin", "group1-shard361of379.bin", "group1-shard362of379.bin", "group1-shard363of379.bin", "group1-shard364of379.bin", "group1-shard365of379.bin", "group1-shard366of379.bin", "group1-shard367of379.bin", "group1-shard368of379.bin", "group1-shard369of379.bin", "group1-shard370of379.bin", "group1-shard371of379.bin", "group1-shard372of379.bin", "group1-shard373of379.bin", "group1-shard374of379.bin", "group1-shard375of379.bin", "group1-shard376of379.bin", "group1-shard377of379.bin", "group1-shard378of379.bin", "group1-shard379of379.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense/kernel", "shape": [774400, 512], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 13], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [13], "dtype": "float32"}]}]}